// using System;
// using System.Collections.Generic;//это нужно для работы с классом List это списки
// namespace project
// {
//     class is_as
//     {
//         static void Main()
//         {
//             //создаем массив из объектов на основе классов. будет создавать динамический массив
//             List<Robot> robots = new List<Robot>();//написали класс, потом указали тип данных, вместо типа данных мы написали название родительского класса, потом название списка robots
//продолжение в класса и объектах


//         }
//     }
// }