/*using System;
//namespace пишем название папки с проектом
namespace project
{
    //название класса обычно совпадает с названием файла *.cs
    class Peremennie
    {
        static void Main()
        {
            /*int number = 10;

            // uint тип данных только для положительных чисел
            uint number2 = 5;
            //byte тип данных для чисел от -255 до 255, в отличии от типа данных int потребляет меньше ОЗУ
            byte a = 255;
            //short тип данных для чисел от  до 32650 или до 33000, в отличии от типа данных int потребляет меньше ОЗУ, но в 2 раза больше чем byte
            short b = 32650;
            //long самый большой по значениям тип данных
            long c = 10;
            //float дробный тип данных, в конце после цифры ставить f надо
            float f = 100004.123456f;
            //double тип данных для дробных чисел очень больших значений, в конце после цифры ставить d надо. Дробную часть отделять именно точкой, не запятой
            double f2 = 1.444447887454d;
            //переменные подчеркиваются как ошибка если их нигде не используют
            //string тип данных для символов, значение пишется в двойных кавычках
            string word = "Переменная ";
            //char тип данных для одного символа, используются одинарные кавычки
            char symbol = 'A';
            //bool тип данных для логических значений true false
            bool istina = true;


            Console.WriteLine(number);
            Console.WriteLine(word + number + ".");

            //Console.ReadKey();

            //ввод данных от пользователя это всегда тип данных стринг, для этого мы его конвертируем
            int num1 = 0, num2 = 0;
            num1 = Convert.ToInt32(Console.ReadLine());
            num2 = Convert.ToInt32(Console.ReadLine());
            Console.WriteLine("Первый " + num1 + " Второй " + num2);

        }

    }
}
*/