
// using System;
// namespace project
// {
//     class Program
//     {
//         static void Main()
//         {
//             //вывод в консоль строки с переходом на следующую строку
//             System.Console.WriteLine("Hello 1");
//             //вывод в консоль строки без перехода на следующую строку
//             //Console.Write("Hello 2");
//             //вывод в консоль строки без перехода на следующую строку но с дописанием \n
//     //        Console.Write("Hello 3\n");
//             //запрос ввода одного символа с последующим завершением программы
//   //          Console.ReadKey();
//             //запрос ввода неограниченного кол-ва символов, завершить можно нажатием enter
// //            Console.ReadLine();
//         }

//     }
// }
